{
    "meta": {
        "lastModified": "2024-03-12",
        "theme": "stackoverflow",
        "tagline": "Web developer | Creative thinker | Solution creator | Change maker"
    },
    "basics": {
        "name": "Iosif Vigh",
        "label": "Senior Software Engineer",
        "email": "hire-me@iosifv.com",
        "phone": "(+44) 759 713 7739",
        "website": "https://iosifv.com",
        "summary": "I am a Senior Software Engineer with **10+ years** of experience architecting systems using **Node.js** and **Laravel**, specialising in backend development, cloud infrastructure and DevOps automation. Proven track record in various engineering roles for clients across industries like fintech, healthtech, and regulatory compliance. I turn complex requirements into **maintainable, high-performance systems** through strategic architecture, clean code, automated testing and resilient deployments - paired with good documentation and mentorship. A core focus is ensuring technical outcomes directly align with business needs. Public projects reflect my commitment to innovation and continuous learning. Seeking **fast-paced environments** leveraging modern stacks and agile practices to solve high-impact problems—whether collaborating within teams or driving solo initiatives.",
        "location": {
            "city": "London",
            "countryCode": "UK"
        },
        "profiles": [
            {
                "network": "github",
                "username": "Github: iosifv",
                "url": "https://github.com/iosifv"
            },
            {
                "network": "linkedin",
                "username": "LinkedIn: iosifv",
                "url": "https://www.linkedin.com/in/iosifv/"
            },
            {
                "network": "stack-overflow",
                "username": "StackOverflow: iosifv",
                "url": "https://stackoverflow.com/users/3219816/iosifv"
            }
        ]
    },
    "skills": [
        {
            "name": "Languages",
            "keywords": [
                "Node.js",
                "Javascript",
                "Typescript",
                "PHP",
                "Solidity",
                "bash"
            ]
        },
        {
            "name": "Frameworks",
            "keywords": [
                "Laravel",
                "Express",
                "Loopback",
                "Serverless",
                "Hardhat"
            ]
        },
        {
            "name": "Dev-Ops",
            "keywords": [
                "AWS",
                "GCP",
                "Terraform",
                "CI/CD",
                "Github Actions",
                "Vercel",
                "Docker"
            ]
        },
        {
            "name": "Databases",
            "keywords": [
                "MySQL",
                "PostgreSQL",
                "MongoDB",
                "AuroraDB",
                "DynamoDB",
                "Redis",
                "SQLite"
            ]
        },
        {
            "name": "Architectures",
            "keywords": [
                "MVC",
                "Microservices",
                "Serverless",
                "Client server",
                "Event-driven",
                "Monolith"
            ]
        },
        {
            "name": "Standards",
            "keywords": [
                "Caching",
                "ORMs",
                "SOLID",
                "ACID",
                "Indexing",
                "REST",
                "OpenAPI",
                "JWT",
                "CLI"
            ]
        }
    ],
    "work": [
        {
            "company": "Casa4 - own LTD (London, UK)",
            "position": "Contractor Software Engineer",
            "website": "https://casa4.co.uk/",
            "startDate": "2018-08-01",
            "summary": "Provided contractor services through my own LTD, Casa4, in between other roles. The following is a list of the most notable projects, specialising in Laravel and Node.js. Involved both in team-based development and solo application building from design to deployment and maintenance.",
            "highlights": [
                "**Artetra** *(Node.js, React, ThreeJS, Solidity, Hardhat, Express, Postgres, MongoDB, AWS, Docker)* \n As an **Acting CTO**, I was responsible with converting business requirements into project features by overseeing the application architecture. I managed a team of 3-4 developers and provided them with necessary assistance. The ecosystem consisted in a backend Express API which connected to blockchain a smart contract written in Solidity, a frontend React app which had a 3D part written in ThreeJS. The project was deployed to an AWS infrastructure using Docker.",

                "**ElectroRent** *(Laravel, MySQL, SQLite, Bash)* \n As a **Backend Engineer** I worked on the API of a large tool renting platform built with Laravel. Responsibilities included designing and implementing new API endpoints, creating database migrations, building new features, debugging complex issues, and optimizing performance across critical application areas. ",

                "**Aliat Optic** *(Node.js, Serverless Framework, Lambda, DynamoDB, AWS, MySQL, Laravel, DigitalOcean)*\n As a **Solution Architect** I designed and developed an invoicing app, integrating external FTP data via AWS Lambda and DynamoDB. This application was successfully used in production for about 3 years with minimal maintenance, demonstrating reliability and efficiency.",

                "**Hurlingham Club** *(Laravel, Laravel Forge, Laravel Envoyer, MySQL, AWS, Docker)* \n As a **Backend and DevOps Engineer** I led the migration of a large application from from a paid provider to the client's own servers. My responsibilities included provisioning the new infrastructure, setting up de CI/DC pipeline, updating the code from PHP5.5 to PHP8.1, updating all the dependencies to the latest stable versions, making sure no data was lost in the DB and creating diagrams to explain each step of the process to the stakeholders.",

                "**TicketTailor** *(PHP, MySQL, SQLite)* \n As a **Backend Engineer** I worked on the API of the second largest ticketing application in Europe. Designed and implemented a testing framework using PHPUnit to automatically scan OpenAPI specs and validate each API endpoint, including all new additions. This significantly improved deployment times combined with strategically assigning tests to the appropriate level (unit, integration, acceptance). Also contributed by adding numerous endpoints to the client-facing API."
            ]
        },
        {
            "company": "True Compliance (London, UK)",
            "position": "Software Engineer",
            "website": "https://truecompliance.co.uk/",
            "startDate": "2020-10-01",
            "endDate": "2022-09-01",
            "summary": "Contributed to the development of a cloud-based compliance management system, enhancing compliance tracking and reporting capabilities.",
            "highlights": [
                "Developed the main API of the system and contributed to designing the ecosystem's serverless architecture, leading to a robust and scalable solution.",
                "Created a reporting application that enabled non-technical stakeholders to preview any key metrics.",
                "Developed various tools for interal use in VueJS, as well as admin dashboards in Laravel Nova for system performance monitoring and reporting.",
                "Also built a bespoke real-time caching system that stores processed relational MySQL data into a MongoDB database controlled and accessed by a serverless API. The purpose is to vastly increase the speed for final users down to near instant results and reduce the load on the main database.",
                "↪ Technologies: Laravel, Laravel Nova, Laravel Vapor, AWS, SQS, VueJS, Node.js, Serverless Framework, Lambda, CLI, Bash"
            ]
        },
        {
            "company": "Skin Analytics (London, UK)",
            "position": "Software Engineer",
            "website": "https://skin-analytics.com/",
            "startDate": "2018-11-01",
            "endDate": "2019-10-01",
            "summary": "Designed and developed main applications and maintained AWS infrastructure, contributing to the company's mission of improving skin health.",
            "highlights": [
                "Led the migration from a NoSQL database (CouchDB) to a relational database (MySQL), resulting in an 11x speed increase without affecting the frontend or user experience. This was achieved by a series of steps, including, creating scripts and processes for provisioning a new server, exporting the CouchDB records, normalising the data, importing it into the newly created server and database, then finally running a series of checks to ensure consistency.",
                "↪ Technologies: Node.js, Express.js, TypeScript, CouchDB, AWS, Loopback, pm2, Angular"
            ]
        },
        {
            "company": "Woooba (London, UK)",
            "position": "Application Developer / Dev-Ops",
            "website": "https://www.woooba.io/",
            "startDate": "2017-02-01",
            "endDate": "2018-11-01",
            "summary": "Sole Backend Engineer responsible for designing, developing, and supporting client applications, driving business growth.",
            "highlights": [
                "Developed and maintained nationwide educational platforms, enhancing the learning experience for thousands of users.",
                "Built a comprehensive financial management application with Laravel and Vue.",
                "Streamlined the management of DigitalOcean droplets through a comprehensive CI setup, resulting in faster deployment processes and increased reliability.",
                "↪ Technologies: Laravel, DigitalOcean, Laravel Forge, MySql, VueJS"
            ]
        },
        {
            "company": "iQU Group (Amsterdam, NL)",
            "position": "PHP Application Developer",
            "startDate": "2015-11-01",
            "endDate": "2017-02-01",
            "summary": "Marketing solutions for game developers.",
            "highlights": [
                "Created complete APIs from start to end as well as libraries which were used by my colleagues. Besides the backend work, I also built an AngularJS client to consume one of the APIs.",
                "Worked on a smaller mobile monitoring project built with Java and PipelineDB.",
                "↪ Technologies: PHP, Laravel, Symfony, API, MySQL, Git, Docker, CLI, PhpUnit, AngularJS, Java"
            ]
        },
        {
            "company": "Project 89109 (Amsterdam, NL)",
            "position": "PHP Application Developer",
            "startDate": "2014-10-01",
            "endDate": "2015-11-01",
            "summary": "Online dating services.",
            "highlights": [
                "As a junior PHP developer working on a bespoke MVC framework, I was responsible for creating new features, fixing bugs, and maintaining the codebase.",
                "↪ Technologies: PHP, API, MySQL, CLI, Git, JS, jQuery."
            ]
        }
    ],
    "projects": [
        {
            "name": "Recspenses",
            "url": "https://www.github.com/iosifv/recspenses/",
            "summary":
            "A production-ready financial web application to calculate recurring monthly expenses. Initially started as a training project to practice my full-stack skills. Features include: a simple UI, multi-currency support including cryptocurrencies and an intuitive tagging system for expense labelling.\nI used the \"T3 Stack\" which is a web development stack focused on simplicity, modularity, and full-stack typesafety. The full technology list is: *NextJS, tRPC, TypeScript, Node.js, Clerk, Drizzle ORM, PostgreSQL, Tailwind CSS, Vercel, GHA*"
        },
        {
            "name": "CLI Path",
            "url": "https://iosifv.github.io/cli-path/",
            "summary":
            "Created a CLI tool to check Google Maps API directions, with saved locations, authentication, and a custom serverless API layer to simplify token management - built for training, touching multiple technologies: *Node.js, Serverless Framework, AWS, Auth0, OpenAPI, VHS, npm, GHA*"
        },
        {
            "name": "Casa4 website",
            "url": "https://casa4.co.uk/",
            "summary":
            "An overengineered personal website built for learning purposes. Themed with *Hugo*, built with *Terraform* and  *Cloudfront*, deployed to *AWS S3* with *Github Actions*."
        },
        {
            "name": "T3 (Terminal Toolbelt Two)",
            "url": "https://www.github.com/iosifv/t3/",
            "summary":
            "Inspired by the naming of Amazon's S3, I built T3 to resemble a framework for improving a terminal user's experience. Features include: an install script, platform selection (osx, ubuntu) specific scripts as well as agnostic ones, multi-machine installs. The interface is powered by charmbracelet/gum, a Terminal UI framework written in Go."
        },
        {
            "name": "Hidden Hash (Cluj-Napoca, RO)",
            "summary":
            "Personal business dealing with mining cryptocurrencies. Worked on Business model, legal compliance, hardware setup, software & security optimization/tweaks/updates, Performance fine tuning with various Bash, Batch or PowerShell scripts."
        }
    ],
    "education": [
        {
            "institution": "Technical University of Cluj-Napoca",
            "area": "Management and Business Engineering",
            "studyType": "Masters",
            "startDate": "2012-01-01",
            "endDate": "2010-01-01",
            "courses": [
                "Operations Management",
                "Business Analytics",
                "Marketing Fundamentals",
                "Human Resource Management",
                "Operations Management"
            ]
        },
        {
            "institution": "Technical University of Cluj-Napoca",
            "area": "Computer Science",
            "studyType": "Bachelor of Engineering",
            "startDate": "2004-01-01",
            "endDate": "2009-01-01",
            "courses": [
                "Object-oriented programming",
                "Data Structures and Algorithms",
                "Advanced Databases",
                "Computer Networks",
                "C++",
                "Java",
                ".NET",
                "SQL",
                "Lisp",
                "Prolog",
                "Xilinx",
                "Assembly",
                "x86 processor",
                "Electronics",
                "Physics",
                "Mathematics"
            ]
        }
    ],
    "interests": [
        {
            "name": "Hobbies",
            "keywords": [
                "Motorcycles",
                "Photography",
                "Chess",
                "HiFi Audio",
                "Boxing"
            ]
        }
    ]
}
