{
    "meta": {
        "lastModified": "2024-03-12",
        "theme": "stackoverflow",
        "tagline": "Senior Backend Engineer | Architecting High-Performance Systems | Cloud-based Applications and Architecture | Available for Remote Projects 🌍"
    },
    "basics": {
        "name": "Iosif Vigh",
        "label": "Senior Software Engineer",
        "email": "hire-me@iosifv.com",
        "phone": "(+44) 759 713 7739",
        "website": "https://iosifv.com",
        "summary": "I am a Senior Software Engineer with **10+ years** of experience architecting systems using **Node.js** and **Laravel**, specialising in backend development, cloud infrastructure and DevOps automation. Proven track record in various engineering roles for clients across industries like fintech, healthtech, and regulatory compliance. I turn complex requirements into **maintainable, high-performance systems** through strategic architecture, clean code, automated testing and resilient deployments - paired with good documentation and mentorship. A core focus is ensuring technical outcomes directly align with business needs. Public projects reflect my commitment to innovation and continuous learning. Seeking **fast-paced environments** leveraging modern stacks and agile practices to solve high-impact problems; whether collaborating within teams or driving solo initiatives.",
        "location": {
            "city": "London",
            "countryCode": "UK"
        },
        "profiles": [
            {
                "network": "github",
                "username": "Github: iosifv",
                "url": "https://github.com/iosifv"
            },
            {
                "network": "linkedin",
                "username": "LinkedIn: iosifv",
                "url": "https://www.linkedin.com/in/iosifv/"
            },
            {
                "network": "stack-overflow",
                "username": "StackOverflow: iosifv",
                "url": "https://stackoverflow.com/users/3219816/iosifv"
            }
        ]
    },
    "skills": [
        {
            "name": "Languages",
            "keywords": [
                "Javascript",
                "Typescript",
                "PHP",
                "Solidity",
                "bash"
            ]
        },
        {
            "name": "Backend",
            "keywords": [
                "Node.js",
                "Laravel",
                "Express",
                "Serverless",
                "Hardhat"
            ]
        },
        {
            "name": "Frontend",
            "keywords": [
                "React",
                "Vue",
                "Angular"
            ]
        },
        {
            "name": "Cloud & DevOps",
            "keywords": [
                "AWS",
                "GCP",
                "Terraform",
                "Docker",
                "CI/CD",
                "Github Actions",
                "Vercel",
                "Observability",
                "Infrastructure as Code"
            ]
        },
        {
            "name": "Databases",
            "keywords": [
                "MySQL",
                "PostgreSQL",
                "Aurora",
                "MongoDB",
                "DynamoDB",
                "Redis",
                "SQLite",
                "Data Modeling",
                "Query Optimization"
            ]
        },
        {
            "name": "Architecture & Design",
            "keywords": [
                "System Design",
                "SOLID",
                "Domain-Driven Design (DDD)",
                "Microservices",
                "Serverless",
                "Event-driven",
                "Monolith",
                "MVC"
            ]
        },
        {
            "name": "Testing",
            "keywords": [
                "PHPUnit",
                "TDD",
                "BDD",
                "Unit Testing",
                "Integration Testing"
            ]
        },
        {
            "name": "Standards",
            "keywords": [
                "REST",
                "OpenAPI",
                "Oauth",
                "JWT",
                "OWASP"
            ]
        },
        {
            "name": "Methodologies",
            "keywords": [
                "Agile",
                "Scrum",
                "Kanban",
                "Lean",
                "Clean Code",
                "Mentoring"
            ]
        }
    ],
    "work": [
        {
            "company": "Casa4 - own LTD (London, UK)",
            "position": "Contractor Software Engineer",
            "website": "https://casa4.co.uk/",
            "startDate": "2018-08-01",
            "summary": "Provided contractor services through my own LTD, Casa4, in between other roles. The following is a list of the most notable projects, specialising in Laravel and Node.js. Involved both in team-based development and solo application building from design to deployment and maintenance.",
            "highlights": [

                "**ElectroRent** *(Laravel, MySQL, SQLite, Bash)* \n As a **Backend Engineer**, I enhanced application performance by optimizing critical API areas and expanded functionality by designing and implementing new endpoints for key business features.",

                "**Aliat Optic** *(Node.js, Serverless Framework, Lambda, DynamoDB, AWS, MySQL, Laravel, DigitalOcean)* \n As a **Solution Architect**, I designed and built a serverless invoicing application that operated reliably in production for over 3 years with minimal maintenance, processing external FTP data via AWS Lambda and DynamoDB.",

                "**Hurlingham Club** *(Laravel, Laravel Forge, Laravel Envoyer, MySQL, AWS, Docker)* \n As a **Backend and DevOps Engineer**, I orchestrated the migration of a major application to the client's own AWS infrastructure. This involved a full technology upgrade from PHP 5.5 to 8.1, provisioning new infrastructure, and establishing a modern CI/CD pipeline, ensuring zero data loss. Throughout the project, I created and presented diagrams to stakeholders to communicate the process and progress at each stage.",

                "**TicketTailor** *(PHP, MySQL, SQLite)* \n As a **Backend Engineer** I worked on the API of the second largest ticketing application in Europe. Designed and implemented a testing framework using PHPUnit to automatically scan OpenAPI specs and validate each API endpoint, including all new additions. This significantly improved deployment times combined with strategically assigning tests to the appropriate level (unit, integration, acceptance). Also contributed by adding numerous endpoints to the client-facing API."
            ]
        },
        {
            "company": "Artetra (remote)",
            "position": "Fractional CTO",
            "startDate": "2021-03-01",
            "endDate": "2024-09-01",
            "summary": "Translated business requirements into actionable project features and oversaw application architecture.",
            "highlights": [
                "Led the development and launch of the MVP, leveraging a team of part-time contractors and very limited resources.",
                "Designed and managed a technology ecosystem comprising a backend Express API integrated with blockchain smart contracts (Solidity), and a React frontend with 3D components (ThreeJS).",
                "Led a team of 3-4 developers, providing technical guidance, managing the product backlog, and supervising deployments to AWS infrastructure using Docker to ensure robust and scalable operations.",
                "↪ Technologies: Node.js, React, ThreeJS, Solidity, Hardhat, Express, Postgres, MongoDB, AWS, Docker"
            ]
        },
        {
            "company": "True Compliance (London, UK)",
            "position": "Software Engineer",
            "website": "https://truecompliance.co.uk/",
            "startDate": "2019-10-01",
            "endDate": "2022-09-01",
            "summary": "Contributed to the development of a cloud-based compliance management system, enhancing compliance tracking and reporting capabilities.",
            "highlights": [
                "Architected and developed the core API and serverless infrastructure, establishing a robust and scalable foundation for all system operations.",
                "Built a suite of internal tools, including a Vue.js reporting application for non-technical stakeholders and Laravel Nova dashboards for system monitoring, significantly improving data accessibility and operational oversight.",
                "Also built a bespoke real-time caching system that stores processed relational MySQL data into a MongoDB database controlled and accessed by a serverless API. The purpose is to vastly increase the speed for final users down to near instant results and reduce the load on the main database.",
                "↪ Technologies: Laravel, Laravel Nova, Laravel Vapor, AWS, SQS, VueJS, Node.js, Serverless Framework, Lambda, CLI, Bash"
            ]
        },
        {
            "company": "Skin Analytics (London, UK)",
            "position": "Software Engineer",
            "website": "https://skin-analytics.com/",
            "startDate": "2018-11-01",
            "endDate": "2019-10-01",
            "summary": "Designed and developed main applications and maintained AWS infrastructure, contributing to the company's mission of improving skin health.",
            "highlights": [
                "Engineered and led the seamless migration from NoSQL (CouchDB) to a relational database (MySQL), achieving an 11x performance increase with zero downtime or impact on the user experience. The process involved creating custom migration scripts, data normalization, and rigorous consistency checks.",
                "↪ Technologies: Node.js, Express.js, TypeScript, CouchDB, AWS, Loopback, pm2, Angular"
            ]
        },
        {
            "company": "Woooba (London, UK)",
            "position": "Application Developer / Dev-Ops",
            "website": "https://www.woooba.io/",
            "startDate": "2017-02-01",
            "endDate": "2018-11-01",
            "summary": "Sole Backend Engineer responsible for designing, developing, and supporting client applications, driving business growth.",
            "highlights": [
                "Designed, built, and maintained multiple large-scale applications, including a nationwide educational platform serving thousands of users and a comprehensive financial management tool, using Laravel and Vue.js.",
                "Established a comprehensive CI/CD pipeline using Laravel Forge for DigitalOcean infrastructure, which significantly accelerated deployment cycles and improved application reliability.",
                "↪ Technologies: Laravel, DigitalOcean, Laravel Forge, MySql, VueJS"
            ]
        },
        {
            "company": "iQU Group (Amsterdam, NL)",
            "position": "PHP Application Developer",
            "startDate": "2014-01-01",
            "endDate": "2017-02-01",
            "summary": "Marketing solutions for game developers.",
            "highlights": [
                "Developed and maintained a variety of marketing applications using vanilla PHP and Symfony, delivering new features and resolving bugs.",
                "Key contributions included implementing scalable APIs, building reusable libraries to enhance team productivity, and creating an internal client with AngularJS",
                "↪ Technologies: PHP, Laravel, Symfony, API, MySQL, Git, Docker, CLI, PhpUnit, AngularJS, Java"
            ]
        }
    ],
    "projects": [
        {
            "name": "Recspenses",
            "url": "https://www.github.com/iosifv/recspenses/",
            "summary":
            "A full-stack, production-ready web app for tracking recurring expenses, built to practice modern, full-stack type-safe development. Features include: a simple UI, multi-currency support including cryptocurrencies and an intuitive tagging system for expense labelling.\n The full technology list is: *NextJS, tRPC, TypeScript, Node.js, Clerk, Drizzle ORM, PostgreSQL, Tailwind CSS, Vercel, GHA*"
        },
        {
            "name": "CLI Path",
            "url": "https://iosifv.github.io/cli-path/",
            "summary":
            "A CLI tool for checking Google Maps directions with saved locations and a custom serverless API for token management. Built for training, touching multiple technologies: *Node.js, Serverless Framework, AWS, Auth0, OpenAPI, VHS, npm, GHA*"
        },
        {
            "name": "Casa4 website",
            "url": "https://casa4.co.uk/",
            "summary":
            "An overengineered personal website built for learning purposes. Themed with *Hugo*, built with *Terraform* and  *Cloudfront*, deployed to *AWS S3* with *Github Actions*."
        },
        {
            "name": "T3 (Terminal Toolbelt Two)",
            "url": "https://www.github.com/iosifv/t3/",
            "summary":
            "Inspired by the naming of Amazon's S3, I built T3 to resemble a framework for improving a terminal user's experience. Features include: an install script, platform selection (osx, ubuntu) specific scripts as well as agnostic ones, multi-machine installs. The interface is powered by charmbracelet/gum, a Terminal UI framework written in Go."
        },
        {
            "name": "Hidden Hash (Cluj-Napoca, RO)",
            "summary":
            "Personal business dealing with mining cryptocurrencies. Worked on Business model, legal compliance, hardware setup, software & security optimization/tweaks/updates, Performance fine tuning with various Bash, Batch or PowerShell scripts."
        }
    ],
    "education": [
        {
            "institution": "Technical University of Cluj-Napoca",
            "area": "Management and Business Engineering",
            "studyType": "Masters",
            "startDate": "2010-01-01",
            "endDate": "2012-01-01",
            "courses": [

            ]
        },
        {
            "institution": "Technical University of Cluj-Napoca",
            "area": "Computer Science",
            "studyType": "Bachelor of Engineering",
            "startDate": "2004-01-01",
            "endDate": "2009-01-01",
            "courses": [

            ]
        }
    ],
    "interests": [
        {
            "name": "Hobbies",
            "keywords": [
                "Motorcycles",
                "Photography",
                "Chess",
                "HiFi Audio",
                "Boxing"
            ]
        }
    ]
}
