{
    "meta": {
        "lastModified": "2024-03-12",
        "theme": "stackoverflow",
        "tagline": "Web developer | Creative thinker | Solution creator | Change maker"
    },
    "basics": {
        "name": "Iosif Vigh",
        "label": "Senior Software Engineer",
        "email": "hire-me@iosifv.com",
        "phone": "(+44) 759 713 7739",
        "website": "https://iosifv.com",
        "summary": "I am a Senior Software Engineer with extensive experience in developing end-to-end projects using Node.js and Laravel. I prioritise writing clean, maintainable code to ensure ease of maintenance and quick onboarding for junior developers. With a natural curiosity and a commitment to continuous learning, I am always exploring new technologies and methodologies to enhance my skills and contribute effectively to my team and stakeholders. I'm currently working on an open-source personal learning project using T3Stack with NextJS, tRPC, Drizzle ORM and Clerk while deploying to Vercel with Github Actions.",
        "location": {
            "city": "London",
            "countryCode": "UK"
        },
        "profiles": [
            {
                "network": "github",
                "username": "Github: iosifv",
                "url": "https://github.com/iosifv"
            },
            {
                "network": "linkedin",
                "username": "LinkedIn: iosifv",
                "url": "https://www.linkedin.com/in/iosifv/"
            },
            {
                "network": "stack-overflow",
                "username": "StackOverflow: iosifv",
                "url": "https://stackoverflow.com/users/3219816/iosifv"
            }
        ]
    },
    "skills": [
        {
            "name": "Languages",
            "keywords": [
                "Node.js",
                "Javascript",
                "Typescript",
                "PHP",
                "Solidity",
                "bash"
            ]
        },
        {
            "name": "Frameworks",
            "keywords": [
                "Laravel",
                "Express",
                "Serverless",
                "Hardhat"
            ]
        },
        {
            "name": "Databases",
            "keywords": [
                "MySQL",
                "PostgreSQL",
                "MongoDB",
                "Redis",
                "Eloquent ORM",
                "Drizzle ORM",
                "Prisma ORM"
            ]
        },
        {
            "name": "Dev-Ops",
            "keywords": [
                "AWS",
                "Terraform",
                "CI/CD",
                "Github Actions",
                "Vercel",
                "Docker"
            ]
        }
    ],
    "work": [
        {
            "name": "Casa4 - own LTD (London, UK)",
            "position": "Contractor Software Engineer",
            "website": "https://casa4.co.uk/",
            "startDate": "2018-08-01",
            "summary": "Provided contractor services through my own LTD, Casa4, in between other roles. The following is a list of the most notable projects, specializing in Laravel and Node.js. Involved both in team-based development and solo application building from design to deployment and maintenance.",
            "highlights": [
                "Artetra (NodeJS, React, ThreeJS, Solidity, Hardhat, Express, Postgres, MongoDB, AWS, Docker)\n As an acting CTO, I was responsible with converting business requirements into project features by overseeing the application architecture. I managed a team of 3-4 developers and provided them with necessary assistance.",
                "ElectroRent (Laravel, MySQL)\n Developed and maintained Laravel code to fix bugs and add new features for a tool-renting platform.",
                "Aliat Optic (NodeJS, Serverless Framework, Lambda, DynamoDB, AWS, MySQL, Laravel, DigitalOcean)\n Designed and developed an invoicing app, integrating external FTP data via AWS Lambda and DynamoDB. This application was successfully used in production for about 3 years with minimal maintenance, demonstrating reliability and efficiency.",
                "Hurlingham Club (Laravel, Laravel Forge, Laravel Envoyer, MySQL, AWS, Docker) \n Led the migration of systems to internal servers, resolving various DevOps issues.",
                "TicketTailor (PHP, MySQL, sqlite)\n Improved the API of a large ticketing application by fixing bugs and adding new features."
            ]
        },
        {
            "name": "True Compliance (London, UK)",
            "position": "Software Engineer",
            "website": "https://truecompliance.co.uk/",
            "startDate": "2020-10-01",
            "endDate": "2022-08-01",
            "summary": "Contributed to the development of a cloud-based compliance management system, enhancing compliance tracking and reporting capabilities.",
            "highlights": [
                "Developed the main API of the system and contributed to designing the ecosystem's serverless architecture, leading to a robust and scalable solution.",
                "Created a reporting application that enabled non-technical stakeholders to preview any key metrics.",
                "Also built a bespoke real-time caching system that stores processed relational data in a NoSQL database. The purpose of this was to vastly increase the speed of the system and reduce the load on the database.",
                "↪ Technologies: Laravel, Laravel Vapor, AWS, VueJS, Node.js, Serverless Framework, CLI, Bash"
            ]
        },
        {
            "name": "Skin Analytics (London, UK)",
            "position": "Software Engineer",
            "website": "https://skin-analytics.com/",
            "startDate": "2018-10-01",
            "endDate": "2019-10-01",
            "summary": "Designed and developed main applications and maintained AWS infrastructure, contributing to the company's mission of improving skin health.",
            "highlights": [
                "Led the migration from a NoSQL database to a relational database, resulting in an 11x speed increase without affecting the frontend or user experience.",
                "↪ Technologies: Node.js, Express.js, TypeScript, AWS, Loopback, pm2, Angular"
            ]
        },
        {
            "name": "Woooba (London, UK)",
            "position": "Application Developer / Dev-Ops",
            "website": "https://www.woooba.io/",
            "startDate": "2017-02-01",
            "endDate": "2018-06-01",
            "summary": "Sole Backend Engineer responsible for designing, developing, and supporting client applications, driving business growth.",
            "highlights": [
                "Developed and maintained nationwide educational platforms, enhancing the learning experience for thousands of users.",
                "Built a comprehensive financial management application with Laravel and Vue.",
                "Managed all DigitalOcean droplets with a CI setup ensuring reliable and efficient deployment processes.",
                "↪ Technologies: Laravel, DigitalOcean, Laravel Forge, MySql, VueJS"
            ]
        },
        {
            "name": "iQU Group (Amsterdam, NL)",
            "position": "PHP Application Developer",
            "startDate": "2015-11-01",
            "endDate": "2016-11-01",
            "summary": "Marketing solutions for game developers.",
            "highlights": [
                "Created complete APIs from start to end as well as libraries which were used by my colleagues.",
                "Another smaller project was built with Java and PipelineDB.",
                "↪ Technologies: PHP, Laravel, Symfony, API, MySQL, Git, Docker, CLI, PhpUnit, AngularJS, Java"
            ]
        },
        {
            "name": "Project 89109 (Amsterdam, NL)",
            "position": "PHP Application Developer",
            "startDate": "2014-10-01",
            "endDate": "2015-11-01",
            "summary": "Online dating services.",
            "highlights": [
                "↪ Technologies: PHP, API, MySQL, CLI, Git, JS, jQuery."
            ]
        },
        {
            "name": "Hidden Hash (Cluj-Napoca, RO)",
            "position": "Hardware Engineer / Dev-Ops",
            "startDate": "2017-11-01",
            "summary": "Family business dealing with mining crypto-currencies.",
            "highlights": [
                "Worked on Business model, Legal compliance, setup, Software & security optimization/tweaks/updates, Performance fine tuning.",
                "Built an open-source watchdog mechanism: github.com/iosifv/amd-vega-startup-scripts"
            ]
        }
    ],
    "projects": [
        {
            "name": "Recspenses",
            "url": "https://www.github.com/iosifv/recspenses/",
            "highlights": [
                "Built a production-ready financial web application (originally a T3 Stack training project) to calculate recurring monthly expenses with a simple UI, multi-currency and cryptocurrency support, and an intuitive tagging system for organization.\n(T3 Stack, NodeJS, NextJS, PostgreSQL, TailwindCSS, Vercel, GHA)"
            ]
        },
        {
            "name": "CLI Path",
            "url": "https://iosifv.github.io/cli-path/",
            "highlights": [
                "Created a CLI tool to check Google Maps directions, with saved locations, authentication, and a custom serverless API layer to simplify token management — built for training, touching multiple technologies\n(NodeJs, Serverless Framework, AWS, Auth0, OpenAPI, VHS, npm, GHA)"
            ]
        },
        {
            "name": "Casa4 website",
            "url": "https://casa4.co.uk/",
            "highlights": [
                "An overengineered personal website built for learning purposes (Hugo, Terraform, Cloudfront, AWS, GHA)"
            ]
        }
    ],
    "education": [
        {
            "institution": "Technical University of Cluj-Napoca",
            "area": "Management and Business Engineering",
            "studyType": "Masters",
            "startDate": "2012-01-01",
            "endDate": "2010-01-01",
            "courses": [
                "Operations Management",
                "Business Analytics",
                "Marketing Fundamentals",
                "Human Resource Management",
                "Operations Management"
            ]
        },
        {
            "institution": "Technical University of Cluj-Napoca",
            "area": "Computer Science",
            "studyType": "Bachelor of Engineering",
            "startDate": "2004-01-01",
            "endDate": "2009-01-01",
            "courses": [
                "Object-oriented programming",
                "Data Structures and Algorithms",
                "Advanced Databases",
                "Computer Networks",
                "C++",
                "Java",
                ".NET",
                "SQL",
                "Lisp",
                "Prolog",
                "Xilinx",
                "Assembly",
                "x86 processor",
                "Electronics",
                "Physics",
                "Mathematics"
            ]
        }
    ],
    "interests": [
        {
            "name": "Hobbies",
            "keywords": [
                "Motorcycles",
                "Photography",
                "Chess",
                "HiFi Audio",
                "Boxing"
            ]
        }
    ]
}
